package mandh.ir.myapplication.models;

import java.util.ArrayList;

import mandh.ir.myapplication.R;

public class StaticsData {
    public static ArrayList<Book> books=new ArrayList<>();

    public static void setBooks(ArrayList<Book> books) {
        StaticsData.books = books;
    }

    public static int[] booksimages={R.drawable.pic1,R.drawable.pic2,R.drawable.pic3,R.drawable.pic4,R.drawable.pic5,R.drawable.pic6,R.drawable.pic7,R.drawable.pic8,R.drawable.pic9,R.drawable.pic10};
    public static String[] booksnames={"علوم ششم","حسابان","فیزیک دهم","عربی جامع","زمین شناسی","علوم پنجم","زبان یازدهم","فارسی جامع","زیست جامع","ریاضی و امار"};
    public static String[] subjects={
            " جموعه\u200Cی کارآموز علوم ششم دبستان با همکاری محمدرضا اعتباری، آزاده رحیمی و پریسا محبی در 128 صفحه نوشته شده و انتشارات مهروماه آن را به چاپ رسانده است. این کتاب مجموعه\u200Cای از بهترین پرسش\u200Cها و مطالب آموزشی منطبق بر متدهای به روز آموزشی دنیا را در اختیار شما قرار می\u200Cدهد",
            " جامعه\u200Cشناسی جامع کنکور کتابی است از مجموعه\u200Cی مرشد که کلیه\u200Cی مطالب کتاب درسی دهم، یازدهم و دوازدهم انسانی را در سطح پیشرفته ارائه می\u200Cدهد و دانش\u200Cآموزان را برای شرکت در امتحانات و کنکور آماده می\u200Cسازد. کتاب\u200Cهای مرشد به\u200Cگونه\u200Cای تألیف شده\u200Cاند که مطالعه آن\u200Cها دانش\u200Cآموز را برای شرکت در آزمون\u200Cهای ورودی دانشگاه\u200Cها آماده می\u200Cسازد. در این کتاب، دانش\u200Cآموز ابتدا با مباحث و نکته\u200Cهای مهم هر درس آشنا شده و با مثال\u200Cهای گوناگون بر آن\u200Cها تسلط می\u200Cیابد",
            " تاب \"عربی پایه کنکور\" با همکاری مشترک علی جعفری\u200Cندوشن، مجید همایی، محمدتقی بابائیان و ایرج کاظمی در 504 صفحه گردآوری شده است. چاپ و نشر این کتاب توسط انتشارات مبتکران صورت پذیرفته و در اختیار دانش\u200Cآموزان قرار گرفته است.",
            " انتشارات مشاوران آموزش با درنظرگرفتن نیاز دانش\u200Cآموزان رشته علوم انسانی در درس ریاضی، دست به تألیف کتاب ریاضی و آمار زده است. به همین جهت با ارائه\u200Cی تمرین\u200Cهای بسیار ذهن دانش\u200Cآموز را برای حل مسائل آن آشنا می\u200Cسازد. به دلیل حساسیت دانش\u200Cآموزان این رشته نسبت به درس ریاضی، در بخش پاسخ\u200C تشریحی روش\u200Cهای مختلف حل سؤالات قرار گرفته تا با مروری بر آن بتوان سؤالات را به آسانی پاسخ داد"
    };



    public static ArrayList<Book> makeData(){
        ArrayList<Videos> videos=new ArrayList<>();
        Videos vp1=new Videos("R.raw.video1","مثلثات","اموزش مثلتات کنکور به شیوه مدرن",0);
        Videos vp2=new Videos("R.raw.video2","اموزش ایفون","اموزش مقدماتی کار با گوشی ایفون و فنون استفاده از ان با استفاده از برنامه های مختلف",1);
        Videos vp3=new Videos("R.raw.video3","اموزش توابع","اموزش توابع متناوب و و مسابل مربوط به انها ",2);
        Videos vp4=new Videos("R.raw.video4","ویژگی توابع","اموزش دامنه و برد توابع با استفاده از روش های نو",3);

        videos.add(vp1);
        videos.add(vp2);
        videos.add(vp3);
        videos.add(vp4);



        return null;
    }

}
